//
// 筛选200以内的素数
//1、不是素数也不是合数，花去
//2、第二个数是素数保留下来，而把2后面的所有能被2整除的数花去
//3、2后面第一个数是3，保留下来，而把3后面所有能被3整除的数花去
//4、这一直做下去就能把全部合数划掉，只剩下素数
#include <stdio.h>
#include <math.h>
int main(){
    int i, j, n, a[201];
    for (i = 1; i <= 200; i++) {
        a[i] = i;
    }
    a[1] = 0;
    for(i=1;i<sqrt(200);i++)
        for(j=i+1;j<=200;j++){
            if (a[i]!=0 && a[j]!=0) {
                if(a[j]%a[i]==0)
                    a[j] = 0;
            }
        }
    for (i = 1; i <= 200; i++)
        if(a[i]!=0)
            printf("%d_", a[i]);
    printf("\n");
}

